app/Controllers/Auth.php

    public function attemptLogin()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'madioti'
 LIMIT 1