app/Controllers/CustomerDataController.php

    public function index()
    {
        $customerDataModel = new CustomerDataModel();
        $data['customers'] = $customerDataModel->findAll();
---
SELECT *
FROM `customer_data`