app/Controllers/MaterialController.php

SELECT *
FROM `materials`
---
    public function index()
    {
        $model = new MaterialModel();
        $data['materials'] = $model->findAll();