app/Controllers/OrdersController.php

SELECT *
FROM `orders`
---
    public function index()
    {
        $data = [
            'orders' => $this->orderModel->findAll(),
        ];